CSI API ETABS v1
cTendonObj.GetLossesDetailed Method
 Retrieves tendon loss data - detailed
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLossesDetailed(
	string Name,
	ref int NumberItems,
	ref string[] TendonName,
	ref double[] CurvatureCoeff,
	ref double[] WobbleCoeff,
	ref double[] LossAnchorage,
	ref double[] LossShortening,
	ref double[] LossCreep,
	ref double[] LossShrinkage,
	ref double[] LossSteelRelax,
	eItemType ItemType = eItemType.Objects
)
Function GetLossesDetailed (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef TendonName As String(),
	ByRef CurvatureCoeff As Double(),
	ByRef WobbleCoeff As Double(),
	ByRef LossAnchorage As Double(),
	ByRef LossShortening As Double(),
	ByRef LossCreep As Double(),
	ByRef LossShrinkage As Double(),
	ByRef LossSteelRelax As Double(),
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cTendonObj
Dim Name As String
Dim NumberItems As Integer
Dim TendonName As String()
Dim CurvatureCoeff As Double()
Dim WobbleCoeff As Double()
Dim LossAnchorage As Double()
Dim LossShortening As Double()
Dim LossCreep As Double()
Dim LossShrinkage As Double()
Dim LossSteelRelax As Double()
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.GetLossesDetailed(Name,
	NumberItems, TendonName, CurvatureCoeff,
	WobbleCoeff, LossAnchorage, LossShortening,
	LossCreep, LossShrinkage, LossSteelRelax,
	ItemType)
int GetLossesDetailed(
	String^ Name,
	int% NumberItems,
	array<String^>^% TendonName,
	array<double>^% CurvatureCoeff,
	array<double>^% WobbleCoeff,
	array<double>^% LossAnchorage,
	array<double>^% LossShortening,
	array<double>^% LossCreep,
	array<double>^% LossShrinkage,
	array<double>^% LossSteelRelax,
	eItemType ItemType = eItemType::Objects
)
abstract GetLossesDetailed :
        Name : string *
        NumberItems : int byref *
        TendonName : string[] byref *
        CurvatureCoeff : float[] byref *
        WobbleCoeff : float[] byref *
        LossAnchorage : float[] byref *
        LossShortening : float[] byref *
        LossCreep : float[] byref *
        LossShrinkage : float[] byref *
        LossSteelRelax : float[] byref *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing tendon object or group, depending on the value of the ItemType item.
NumberItems
Type: System.Int32
 The total number of items retrieved for the specified tendon objects
TendonName
Type: System.String[]
 This is an array that includes the name of the tendon object associated with each value.
CurvatureCoeff
Type: System.Double[]
 This is an array that includes the curvature coefficient
WobbleCoeff
Type: System.Double[]
 This is an array that includes the wobble coefficient [1/L]
LossAnchorage
Type: System.Double[]
 This is an array that includes the anchorage set slip [L]
LossShortening
Type: System.Double[]
 This is an array that includes the elastic shortening stress [F/L2]
LossCreep
Type: System.Double[]
 This is an array that includes the creep stress [F/L2]
LossShrinkage
Type: System.Double[]
 This is an array that includes the shrinkage stress [F/L2]
LossSteelRelax
Type: System.Double[]
 This is an array that includes the steel relaxation stress [F/L2]
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, data is retrieved for the tendon object specified by the Name item.
 If this item is Group, data is retrieved for all tendon objects in the group specified by the Name item.
 If this item is SelectedObjects, data is retrieved for all selected tendon objects, and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved; otherwise it returns a nonzero value.
See Also
Reference
cTendonObj Interface
ETABSv1 Namespace